import {
  ContainerWrap,
  ContainerComponent,
  TitlePage,
} from './Container.styled';

const Container = () => {

  return (
      <ContainerWrap>
        <ContainerComponent>
          <TitlePage>TitlePage</TitlePage>
          <p>
            "Потрібно реалізувати блок навігації з наступними маршрутами: -
            /categories/:categoryName - приватний, переадресовує на сторінку
            CategoriesPage - /add - приватний, переадресовує на сторінку
            додавання рецепту - AddRecipesPage - /my - приватний, переадресовує
            на сторінку до даних рецептів користувачем - MyRecipesPage -
            /favorite - приватний, переадресовує на сторінку обраних рецептів -
            FavoritePage - /shopping-list - приватний, переадресовує на сторінку
            зі списком покупок - ShoppingListPage - /search - приватний - на
            макеті іконка з лупою, переадресовує на сторінку SearchPage з
            встановленим на сторінці типом пошуку query Поточний маршрут, на
            якому знаходиться користувач, повинен виділятися як активна
            сторінка. На планшетній і мобільній версії компонент потрібно
            відобразити в бургер меню" "Компонент рендерить блок з розміткою
            фото користувача в якості контенту, або іконкою, якщо таке фото
            відсутнє та ім'ям користувача. Клік по даному блоку повинен
            відрендерити компонент UserLogoModal" "Компонент рендерить модалку з
            кнопками: - EditProfile - відкриває компонент(модалку) UserInfoModal
            - LogoutBtn - компонент який виконує логаут користувача." "Компонент
            рендерить модалку з формою, в якій знаходяться поля: - для
            додавання/зміни фото користувача - для зміни імені користувача -
            кнопка для відправки даних Модалка повинна закриватись: - по кліку
            на бекдроп - натисканню на Escape - по сабміту форми, після
            отримання успішної відповіді" "Компонент рендерить кнопку, по кліку
            на яку відправляється запит на бек і в результаті видаляється сесія
            користувача на бекенді. Після успішної відповіді потрібно очистити
            глобальний стейт в store зі всіма даними, що були у авторизованого
            користувача. ДОДАТКОВЕ ЗАВДАННЯ!!! Компонент рендерить кнопку, яка
            відкриває модалку з кнопками: - Cancel - клік по кнопці закриває
            модалку - Logout - клік по кнопці відправляє запит на бек і в
            результаті видаляє сесію користувача на бекенді. Після успішної
            відповіді потрібно очистити глобальний стейт в store зі всіма
            даними, що були у авторизованого користувача. Також модалка повинна
            закриватись по кліку на бекдроп та натисканні на Escape" "Перемикач
            теми ДОДАТКОВЕ ЗАВДАННЯ!!! Блок змінює тему зі світлої на темну і
            навпаки Обрана тема зберігається в сховищі і застосовується при
            вході користувача на сторінку застосунку"
          </p>
          <TitlePage>TitlePage</TitlePage>
          <p>
            "Потрібно реалізувати блок навігації з наступними маршрутами: -
            /categories/:categoryName - приватний, переадресовує на сторінку
            CategoriesPage - /add - приватний, переадресовує на сторінку
            додавання рецепту - AddRecipesPage - /my - приватний, переадресовує
            на сторінку до даних рецептів користувачем - MyRecipesPage -
            /favorite - приватний, переадресовує на сторінку обраних рецептів -
            FavoritePage - /shopping-list - приватний, переадресовує на сторінку
            зі списком покупок - ShoppingListPage - /search - приватний - на
            макеті іконка з лупою, переадресовує на сторінку SearchPage з
            встановленим на сторінці типом пошуку query Поточний маршрут, на
            якому знаходиться користувач, повинен виділятися як активна
            сторінка. На планшетній і мобільній версії компонент потрібно
            відобразити в бургер меню" "Компонент рендерить блок з розміткою
            фото користувача в якості контенту, або іконкою, якщо таке фото
            відсутнє та ім'ям користувача. Клік по даному блоку повинен
            відрендерити компонент UserLogoModal" "Компонент рендерить модалку з
            кнопками: - EditProfile - відкриває компонент(модалку) UserInfoModal
            - LogoutBtn - компонент який виконує логаут користувача." "Компонент
            рендерить модалку з формою, в якій знаходяться поля: - для
            додавання/зміни фото користувача - для зміни імені користувача -
            кнопка для відправки даних Модалка повинна закриватись: - по кліку
            на бекдроп - натисканню на Escape - по сабміту форми, після
            отримання успішної відповіді" "Компонент рендерить кнопку, по кліку
            на яку відправляється запит на бек і в результаті видаляється сесія
            користувача на бекенді. Після успішної відповіді потрібно очистити
            глобальний стейт в store зі всіма даними, що були у авторизованого
            користувача. ДОДАТКОВЕ ЗАВДАННЯ!!! Компонент рендерить кнопку, яка
            відкриває модалку з кнопками: - Cancel - клік по кнопці закриває
            модалку - Logout - клік по кнопці відправляє запит на бек і в
            результаті видаляє сесію користувача на бекенді. Після успішної
            відповіді потрібно очистити глобальний стейт в store зі всіма
            даними, що були у авторизованого користувача. Також модалка повинна
            закриватись по кліку на бекдроп та натисканні на Escape" "Перемикач
            теми ДОДАТКОВЕ ЗАВДАННЯ!!! Блок змінює тему зі світлої на темну і
            навпаки Обрана тема зберігається в сховищі і застосовується при
            вході користувача на сторінку застосунку"
          </p>
        </ContainerComponent>
      </ContainerWrap>
  );
};

export default Container;